---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.WallHeightType
source: html/e36e8b6b-08bd-76b8-82ef-90194ff490fb.htm
---
# Autodesk.Revit.DB.ParameterTypeId.WallHeightType Property

"Top Constraint"

## Syntax (C#)
```csharp
public static ForgeTypeId WallHeightType { get; }
```